DataProcessors/атл_ПросмотрУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>атл_ПросмотрУведомлений</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СписокУведомлений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаСоздания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗадачаМобильномуСотруднику</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.атл_ЗадачаМобильномуСотруднику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторУведомления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидУведомленияУМС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.атл_ВидыУведомлений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстУведомления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПрочтения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/атл_ПрочитанныеУведомленияПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>атл_ПрочитанныеУведомленияПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПрочтения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСкрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторУведомления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/атл_ПросмотрУведомлений/Forms/ФормаУведомленияПоЗадачеУМС/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаСоздания = Параметры.ДатаСоздания;
	ЗадачаМобильномуСотруднику = Параметры.ЗадачаМобильномуСотруднику;
	ИдентификаторУведомления = Параметры.ИдентификаторУведомления;
	ТекстУведомления = Параметры.ТекстУведомления;	
	
	//регистрируем прочтение если необходимо
	ЗаписьРегистраПрочтения = РегистрыСведений.атл_ПрочитанныеУведомленияПользователей.СоздатьМенеджерЗаписи();
	ЗаписьРегистраПрочтения.ИдентификаторУведомления = ИдентификаторУведомления;
	ЗаписьРегистраПрочтения.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	ЗаписьРегистраПрочтения.Прочитать();
	
	Если ЗаписьРегистраПрочтения.ДатаПрочтения = Дата("00010101") Тогда
		Если Не ЗаписьРегистраПрочтения.Выбран() Тогда
			ЗаписьРегистраПрочтения.ИдентификаторУведомления = ИдентификаторУведомления;
			ЗаписьРегистраПрочтения.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		ЗаписьРегистраПрочтения.ДатаПрочтения = ТекущаяДата();
		ЗаписьРегистраПрочтения.Записать();				
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗадачаМобильномуСотруднику) Тогда
		Если ДатаСоздания = Дата("00010101") Тогда
			ЭтаФорма.Заголовок = "Уведомление";
		Иначе
			ЭтаФорма.Заголовок = "Уведомление от " +  ДатаСоздания;
		КонецЕсли;
		ДокументЗанятостиРесурса = ЗадачаМобильномуСотруднику.ДокументЗанятостиРесурса;
		ЗадачаИсполнителя = ЗадачаМобильномуСотруднику.ЗадачаИсполнителя;
		Если ЗначениеЗаполнено(ЗадачаМобильномуСотруднику.НомерМК) Тогда
			Элементы.НадписьЗадачаМобильномуСотруднику.Заголовок = "Задача мобильному сотруднику №МК " + ЗадачаМобильномуСотруднику.НомерМК + " от " + ЗадачаМобильномуСотруднику.Дата;
		Иначе
			Элементы.НадписьЗадачаМобильномуСотруднику.Заголовок = "Задача мобильному сотруднику № " + ЗадачаМобильномуСотруднику.Номер + " от " + ЗадачаМобильномуСотруднику.Дата;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


#Область КомандыФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Скрыть(Команда)
	
	УстановитьОтметкуОСкрытииУведомления();	
	Закрыть();

КонецПроцедуры
	
#КонецОбласти



#Область ПрочиеПроцедурыИФункции

&НаКлиенте
Процедура НадписьЗадачаМобильномуСотрудникуНажатие(Элемент)
	
	СтандартнаяОбработка = Ложь;
	
	мПараметрыФормы = Новый Структура;
	мПараметрыФормы.Вставить("Ключ", ЗадачаМобильномуСотруднику); 
	ОткрытьФорму("Документ.атл_ЗадачаМобильномуСотруднику.ФормаОбъекта", мПараметрыФормы);

КонецПроцедуры

&НаСервере
Процедура УстановитьОтметкуОСкрытииУведомления()
	
	ЗаписьРегистраПрочтения = РегистрыСведений.атл_ПрочитанныеУведомленияПользователей.СоздатьМенеджерЗаписи();
	ЗаписьРегистраПрочтения.ИдентификаторУведомления = ИдентификаторУведомления;
	ЗаписьРегистраПрочтения.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	ЗаписьРегистраПрочтения.Прочитать();
	
	ЗаписыватьЗаписьРегистра = Ложь;
	
	Если Не ЗаписьРегистраПрочтения.Выбран() Тогда
		ЗаписьРегистраПрочтения.ИдентификаторУведомления = ИдентификаторУведомления;
		ЗаписьРегистраПрочтения.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		ЗаписыватьЗаписьРегистра = Истина;
	КонецЕсли;
	
	Если ЗаписьРегистраПрочтения.ДатаПрочтения = Дата("00010101") Тогда		
		ЗаписьРегистраПрочтения.ДатаПрочтения = ТекущаяДата();
		ЗаписыватьЗаписьРегистра = Истина;
	КонецЕсли;
	
	Если ЗаписьРегистраПрочтения.ДатаСкрытия = Дата("00010101") Тогда
		ЗаписьРегистраПрочтения.ДатаСкрытия = ТекущаяДата();
		ЗаписыватьЗаписьРегистра = Истина;
	КонецЕсли;
		
	Если ЗаписыватьЗаписьРегистра Тогда
		ЗаписьРегистраПрочтения.Записать();		
	КонецЕсли;	
	
КонецПроцедуры
	
#КонецОбласти
